server/app/controllers/categories_controller.rb

    def index
        categories = Category.all
---
SELECT "categories".* FROM "categories"

    def show_cat
        user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        user = User.find_by!(id: session[:user_id])
        category = user.categories.create!(category_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "categories" ("category", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category", "Europe"], ["user_id", 1], ["created_at", "2023-03-31 04:18:19.830410"], ["updated_at", "2023-03-31 04:18:19.830410"]]

    def destroy
        category = Category.find(params[:id])
        category.delete
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 5]]