server/app/controllers/expressions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "expressions" ("french", "english", "target", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["french", "c'est dingue"], ["english", "it's crazy"], ["target", "fr"], ["user_id", 1], ["created_at", "2023-03-28 23:36:08.458174"], ["updated_at", "2023-03-28 23:36:08.458174"]]
---
    def create
        user = User.find_by!(id: session[:user_id])
        expression = user.expressions.create!(expression_params)

SELECT "expressions".* FROM "expressions" WHERE "expressions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "expressions" WHERE "expressions"."id" = $1  [["id", 4]]
---
    def destroy
        expression = Expression.find(params[:id])
        expression.delete