server/app/controllers/lists_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "lists" ("category_id", "word_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 5], ["word_id", 1], ["user_id", 1], ["created_at", "2023-03-29 21:59:43.512282"], ["updated_at", "2023-03-29 21:59:43.512282"]]
---
    def create
        user = User.find_by!(id: session[:user_id])
        list = user.lists.create(list_params)