server/app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "x"], ["password_digest", "$2a$12$nNGhmGlv2bK7RhmBwXlYb.PcGgMhVxZsGBbTpdJJLXmYaPUu7uWKW"], ["created_at", "2023-03-28 23:27:45.843479"], ["updated_at", "2023-03-28 23:27:45.843479"]]

    def show

        user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]