server/app/controllers/words_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "words" ("french", "english", "target", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["french", "fou"], ["english", "crazy"], ["target", "fr"], ["user_id", 1], ["created_at", "2023-03-28 23:35:47.555716"], ["updated_at", "2023-03-28 23:35:47.555716"]]
---
    def create
        user = User.find_by!(id: session[:user_id])
        word = user.words.create!(word_params)

SELECT "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "words" WHERE "words"."id" = $1  [["id", 5]]
---
    def destroy
        word = Word.find(params[:id])
        word.delete