server/app/controllers/wordstars_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "wordstars" ("category_id", "word_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 1], ["word_id", 1], ["user_id", 1], ["created_at", "2023-03-30 18:19:12.724604"], ["updated_at", "2023-03-30 18:19:12.724604"]]
---
    def create
        user = User.find_by!(id: session[:user_id])
        # byebug
        list = user.wordstars.create!(list_params)